ipi/tutorial/01/01.tex
% Created 2016-12-18 So 16:32
\documentclass[koma,a4paper,10pt]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[bottom=3cm,top=3cm]{geometry}
\usepackage[ngerman, germanb]{babel}%
\usepackage{siunitx}%
\usepackage{fontspec}%
\sisetup{load-configurations = abbrevations}%
\newcommand{\estimates}{\overset{\scriptscriptstyle\wedge}{=}}%
\usepackage{mathtools}%
\DeclarePairedDelimiter\abs{\lvert}{\rvert}%
\DeclarePairedDelimiter\norm{\lVert}{\rVert}%
\DeclareMathOperator{\Exists}{\exists}%
\DeclareMathOperator{\Forall}{\forall}%
\def\colvec#1{\left(\vcenter{\halign{\hfil$##$\hfil\cr \colvecA#1;;}}\right)}
\def\colvecA#1;{\if;#1;\else #1\cr \expandafter \colvecA \fi}
\usepackage{minted}
\usepackage{makecell}
\usemintedstyle{perldoc}
\usepackage{tikz}
\usetikzlibrary{arrows,automata}
\usepackage{tikzscale}
\usepackage{filecontents}
\usepackage{rotating}
\usepackage{pdflscape}
\usepackage{adjustbox}
\author{Robin Heinemann}
\date{\today}
\title{Einführung in die Anwendungsorientierte Informatik - Übung 1}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Aufgabe 1}
\label{sec-1}
notwendige Zustände:
\begin{itemize}
\item idle
\item 1€ bezahlt
\item 2€ bezahlt
\item Außer Betrieb
\item Münzkassette überprüfen
\end{itemize}
notwendige Ereignisse:
\begin{itemize}
\item 1€ eingeworfen
\item 2€ eingeworfen
\item Münze $\neq 1€ \vee 2€$
\item Abbrechen gedrückt
\item Münzkassette voll
\item Münzkassette nicht voll
\end{itemize}
notwendige Aktionen
\begin{itemize}
\item Münze auswerfen
\item Fahrkarte drucken
\item Meldung "`Außer Betrieb"' anzeigen
\end{itemize}


\begin{figure}[H]
\centering
\small
\resizebox{\textwidth}{!}{%
\begin{tikzpicture}[->,>=stealth',auto,node distance=8cm, semithick, text width=2.5cm, align=center, sloped]
\node[initial,state] (idle) {idle};
\node[state] (1€) [above right of=idle] {1€ bezahlt};
\node[state] (2€) [below right of=1€] {2€ bezahlt};
\node[state] (mk) [below left of=2€]{Münzkassette überprüfen};
\node[state] (ab) [below of=idle]{Außer Betrieb};
\path
(idle) edge [loop above] node [above] {Münze $\neq 1€ \vee 2€$} node [below] {Münze wieder auswerfen} (idle)
       edge [loop below] node {Abbrechen gedrückt} (idle)
       edge node [above] {1€ eingeworfen} (1€)
       edge [bend left] node {2€ eingeworfen} (2€)
(1€)   edge node [above] {1€ eingeworfen} (2€)
       edge [loop above] node [above] {Münze $\neq 1€ \vee 2€$} node [below] {Münze wieder auswerfen} (1€)
       edge node [above] {2€ eingeworfen} node [below] {Fahrkarte drucken} (mk)
       edge [bend right] node [above] {Abbrechen gedrückt} node [below] {1€ auswerfen} (idle)
(2€)   edge node [above] {1€ eingeworfen} node [below] {Fahrkarte drucken}(mk)
       edge [loop above] node [above] {Münze $\neq 1€ \vee 2€$} node [below] {Münze wieder auswerfen} (2€)
       edge [loop left=120] node [above] {2€ eingeworfen} node [below] {2€ auswerfen} (2€)
       edge [bend left] node [above] {Abbrechen gedrückt} node [below] {2€ auswerfen} (idle)
(mk)   edge node [above] {Münzkassette voll} (ab)
       edge node [above] {Münzkassette nicht voll} (idle)
(ab)   edge [loop below] node [above] {Münze eingeworfen} node [below] {Münze wieder auswerfen, Meldung "`Außer Betrieb"' anzeigen} (ab);
\end{tikzpicture}
}%
\end{figure}

\begin{sidewaysfigure}
\section{Aufgabe 2a}
\label{sec-2}
\begin{center}
\begin{tabular}{|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|}
Zustand $\backslash$ Ereignis & Buch trifft ein & Buch wird ausgeliehen & Buch wird zurückgegeben & Timeout & schlechter Zustand & guter Zustand\\
\hline
Grundzustand & Katalogisieren, Timer starten 8 Wochen, $\implies$ \{ausleihbar\} & \% & \% & \% & \% & \%\\
ausleihbar & \% & Timer reset, Timer starten 4 Wochen, $\implies$ \{verliehen\} & \% & $\implies$ \{Buch überprüfen\} & \% & \%\\
Buch überprüfen & \% & \% & \% & \% & Buch aus Katalog streichen, Buch wegwerfen, $\implies$ \{Grundzustand\} & Timer starten 8 Wochen, $\implies$ \{ausleihbar\}\\
verliehen & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{verliehen\} & Timer reset, $\implies$ \{ausleihbar\} & erste Mahnung versenden, Timer auf 2 Wochen, $\implies$ \{erste Mahnung\} & \% & \%\\
erste Mahnung & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{verliehen\} & Timer reset, 5€ einfordern, $\implies$ \{ausleihbar\} & zweite Mahnung versenden, Timer auf 1 Woche, $\implies$ \{zweite Mahnung\} & \% & \%\\
zweite Mahnung & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{verliehen\} & 20€ einfordern, $\implies$ \{ausleihbar\} & Buch aus Katalog streichen, Rechtsanwalt einschalten, $\implies$ \{Grundzustand\} & \% & \%\\
\end{tabular}
\end{center}
\end{sidewaysfigure}

\begin{sidewaysfigure}
\section{Aufgabe 2b}
\label{sec-3}
\begin{adjustbox}{width=\textwidth}
\begin{tabular}{|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|p{3cm}|}
Zustand $\backslash$ Ereignis & Buch trifft ein & Buch wird ausgeliehen & Buch wird zurückgegeben & Timeout & schlechter Zustand & guter Zustand & Buch wird vorbestellt\\
\hline
Grundzustand & Katalogisieren, Timer starten 8 Wochen, $\implies$ \{ausleihbar\} & \% & \% & \% & \% & \% & \%\\
ausleihbar & \% & Timer reset, Timer starten 4 Wochen, $\implies$ \{verliehen\} & \% & $\implies$ \{Buch überprüfen\} & \% & \% & \%\\
Buch überprüfen & \% & \% & \% & \% & Buch aus Katalog streichen, Buch wegwerfen, $\implies$ \{Grundzustand\} & Timer starten 8 Wochen, $\implies$ \{ausleihbar\} & \%\\
verliehen & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{verliehen\} & Timer reset, $\implies$ \{ausleihbar\} & erste Mahnung versenden, Timer auf 2 Wochen, $\implies$ \{erste Mahnung\} & \% & \% & Buch vorbestelen, $\implies$ \{verliehen (vorbestellt)\}\\
erste Mahnung & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{erste Mahnung\} & Timer reset, 5€ einfordern, $\implies$ \{ausleihbar\} & zweite Mahnung versenden, Timer auf 1 Woche, $\implies$ \{zweite Mahnung\} & \% & \% & Buch vorbestelen, $\implies$ \{verliehen (vorbestellt)\}\\
zweite Mahnung & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{zweite Mahnung\} & 20€ einfordern, $\implies$ \{ausleihbar\} & Buch aus Katalog streichen, Rechtsanwalt einschalten, $\implies$ \{Grundzustand\} & \% & \% & Buch vorbestelen, $\implies$ \{verliehen (vorbestellt)\}\\
verliehen (vorbestellt) & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{verliehen (vorbestellt)\} & Timer 4 Wochen, Vorbesteller informieren, $\implies$ \{verliehen\} & erste Mahnung versenden, Timer auf 2 Wochen, $\implies$ \{erste Mahnung (verliehen)\} & \% & \% & \%\\
erste Mahnung (vorbestellt) & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{erste Mahnung (vorbestellt)\} & Timer 4 Wochen, Vorbesteller informieren, 5€ einfordern, $\implies$ \{verliehen\} & zweite Mahnung versenden, Timer auf 1 Woche, $\implies$ \{zweite Mahnung (verliehen)\} & \% & \% & \%\\
zweite Mahnung (vorbestellt) & \% & Fehlermeldung "Buch ist verliehen" $\implies$ \{zweite Mahnung (vorbestellt)\} & Timer 4 Wochen, Vorbesteller informieren, 20€ einfordern, $\implies$ \{verliehen\} & Buch aus Katalog streichen, Rechtsanwalt einschalten, $\implies$ \{Grundzustand\} & \% & \% & \%\\
\end{tabular}
\end{adjustbox}
\end{sidewaysfigure}
\pagebreak
\subsection{Warteliste}
\label{sec-3-1}
Ein endlicher Automat kann keine beliebig große Warteliste implementieren, denn für jeden Eintrag wäre (mindestens) ein weiterer Zustand nötig. Außerdem gäbe es Probleme einer Position in der Warteliste einen Namen zuzuordnen und somit den richtigen Vorbesteller zu informieren.
\section{Aufgabe 3}
\label{sec-4}
\subsection{Teilaufgabe a}
\label{sec-4-1}
\subsubsection{A $\to$ B}
\label{sec-4-1-1}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei C & C frei\\
\hline
heranfahren & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
warten & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}
\subsection{Teilaufgabe b}
\label{sec-4-2}
\subsubsection{B $\to$ A}
\label{sec-4-2-1}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei C & C frei\\
\hline
heranfahren & $\implies$ \{weiterfahren\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}

\subsubsection{A $\to$ C}
\label{sec-4-2-2}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei C & C frei\\
\hline
heranfahren & $\implies$ \{weiterfahren\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}

\subsubsection{C $\to$ A}
\label{sec-4-2-3}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei B & C frei\\
\hline
heranfahren & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
warten & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}

\subsubsection{B $\to$ C}
\label{sec-4-2-4}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei A & A frei\\
\hline
heranfahren & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
warten & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}

\subsubsection{C $\to$ B}
\label{sec-4-2-5}
\begin{center}
\begin{tabular}{lll}
Zustand $\backslash$ Ereignis & Fahrzeug bei B & B frei\\
\hline
heranfahren & $\implies$ \{warten\} & $\implies$ \{weiterfahren\}\\
weiterfahren & \% & \%\\
\end{tabular}
\end{center}
\subsection{Teilaufgabe c}
\label{sec-4-3}
Ein \textit{deadlock} würde zum Beispiel bei folgenden Bedingungen entstehen:
\begin{itemize}
\item C $\to$ A
\item A $\to$ B
\item B $\to$ C
\end{itemize}
Die könnte im echten Straßenverkehr entstehen, wenn gleichzeitig drei Fahrzeuge, jeweils eins von jeder Seite der Kreuzung, an die Kreuzung heranfahren und entsprechend der Bedienungen abbiegen.
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}
